*** libs/keyforge-physics/src/lib.rs:40:9: replace ScoringEngine::score -> f32 with 1.0

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace ScoringEngine::score -> f32 with 1.0
@@ -32,21 +32,17 @@
         cost_overrides: &[(usize, usize, f32)],
     ) -> Result<Self, PhysicsError> {
         let ctx = Compiler::compile(keyboard, corpus, rubric, cost_overrides)?;
         Ok(Self { ctx })
     }
 
     #[instrument(skip(self, layout))]
     pub fn score(&self, layout: &Layout) -> f32 {
-        let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
-            .expect("Physics Violation: Layout size mismatch");
-        
-        let mut pos_map = vec![65535u16; 65536];
-        score_layout(&self.ctx, &validated, &mut pos_map) as f32 / SCORE_SCALE
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[instrument(skip(self, layout))]
     pub fn analyze(&self, layout: &Layout) -> AnalysisReport {
         let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         analyze_layout(&self.ctx, &validated)
     }

---- test_missing_keys_in_layout stdout ----

thread 'test_missing_keys_in_layout' (2284194) panicked at libs/keyforge-physics/tests/edge_cases.rs:144:5:
assertion `left == right` failed
  left: 1.0
 right: 0.0

---- test_math_boundaries_infinity stdout ----

thread 'test_math_boundaries_infinity' (2284192) panicked at libs/keyforge-physics/tests/edge_cases.rs:79:5:
assertion failed: score > 1_000_000.0

failures:
    test_math_boundaries_infinity
    test_missing_keys_in_layout

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
