*** libs/keyforge-physics/src/lib.rs:40:9: replace ScoringEngine::score -> f32 with -1.0

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace ScoringEngine::score -> f32 with -1.0
@@ -32,21 +32,17 @@
         cost_overrides: &[(usize, usize, f32)],
     ) -> Result<Self, PhysicsError> {
         let ctx = Compiler::compile(keyboard, corpus, rubric, cost_overrides)?;
         Ok(Self { ctx })
     }
 
     #[instrument(skip(self, layout))]
     pub fn score(&self, layout: &Layout) -> f32 {
-        let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
-            .expect("Physics Violation: Layout size mismatch");
-        
-        let mut pos_map = vec![65535u16; 65536];
-        score_layout(&self.ctx, &validated, &mut pos_map) as f32 / SCORE_SCALE
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[instrument(skip(self, layout))]
     pub fn analyze(&self, layout: &Layout) -> AnalysisReport {
         let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         analyze_layout(&self.ctx, &validated)
     }

---- test_public_api_wrappers stdout ----

thread 'test_public_api_wrappers' (2285028) panicked at libs/keyforge-physics/tests/coverage_tests.rs:167:5:
Score result was -1, expected > 0

failures:
    test_public_api_wrappers

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
