*** libs/keyforge-physics/src/lib.rs:44:66: replace / with % in ScoringEngine::score

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace / with % in ScoringEngine::score
@@ -36,17 +36,17 @@
     }
 
     #[instrument(skip(self, layout))]
     pub fn score(&self, layout: &Layout) -> f32 {
         let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         
         let mut pos_map = vec![65535u16; 65536];
-        score_layout(&self.ctx, &validated, &mut pos_map) as f32 / SCORE_SCALE
+        score_layout(&self.ctx, &validated, &mut pos_map) as f32 % /* ~ changed by cargo-mutants ~ */ SCORE_SCALE
     }
 
     #[instrument(skip(self, layout))]
     pub fn analyze(&self, layout: &Layout) -> AnalysisReport {
         let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         analyze_layout(&self.ctx, &validated)
     }

---- test_public_api_wrappers stdout ----

thread 'test_public_api_wrappers' (2285930) panicked at libs/keyforge-physics/tests/coverage_tests.rs:167:5:
Score result was 0, expected > 0

failures:
    test_public_api_wrappers

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
