*** libs/keyforge-physics/src/lib.rs:44:66: replace / with * in ScoringEngine::score

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace / with * in ScoringEngine::score
@@ -36,17 +36,17 @@
     }
 
     #[instrument(skip(self, layout))]
     pub fn score(&self, layout: &Layout) -> f32 {
         let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         
         let mut pos_map = vec![65535u16; 65536];
-        score_layout(&self.ctx, &validated, &mut pos_map) as f32 / SCORE_SCALE
+        score_layout(&self.ctx, &validated, &mut pos_map) as f32 * /* ~ changed by cargo-mutants ~ */ SCORE_SCALE
     }
 
     #[instrument(skip(self, layout))]
     pub fn analyze(&self, layout: &Layout) -> AnalysisReport {
         let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         analyze_layout(&self.ctx, &validated)
     }

---- test_engine_matches_oracle stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Aborting shrinking after the PROPTEST_MAX_SHRINK_ITERS environment variable or ProptestConfig.max_shrink_iters iterations (set 400 to a large(r) value to shrink more; current configuration: 400 iterations)

thread 'test_engine_matches_oracle' (2287286) panicked at libs/keyforge-physics/tests/oracle_parity.rs:84:1:
Test failed: Divergence! Fast: 73800860000000000, Oracle: 73800.85, Diff: 73800860000000000 (Allowed: 738008560000) at libs/keyforge-physics/tests/oracle_parity.rs:118.
minimal failing input: kb = Keyboard {
    keys: [
        KeyNode {
            index: 0,
            label: "k0",
            x: 0.0,
            y: 0.0,
            w: 1.0,

failures:
    test_engine_matches_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 43.05s

*** result: Failure(101)
