*** libs/keyforge-physics/src/lib.rs:49:9: replace ScoringEngine::analyze -> AnalysisReport with Default::default()

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace ScoringEngine::analyze -> AnalysisReport with Default::default()
@@ -41,19 +41,17 @@
             .expect("Physics Violation: Layout size mismatch");
         
         let mut pos_map = vec![65535u16; 65536];
         score_layout(&self.ctx, &validated, &mut pos_map) as f32 / SCORE_SCALE
     }
 
     #[instrument(skip(self, layout))]
     pub fn analyze(&self, layout: &Layout) -> AnalysisReport {
-        let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
-            .expect("Physics Violation: Layout size mismatch");
-        analyze_layout(&self.ctx, &validated)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     #[instrument(skip(self, layout))]
     pub fn suggest_improvements(&self, layout: &Layout) -> Vec<SwapSuggestion> {
         suggest_swaps(&self.ctx, layout)
     }
 
     pub fn calculate_swap_delta(

---- tests::test_analyze_layout_comprehensive stdout ----

thread 'tests::test_analyze_layout_comprehensive' (2288527) panicked at libs/keyforge-physics/src/lib.rs:193:34:
index out of bounds: the len is 0 but the index is 0

---- tests::test_analyze_layout_empty stdout ----

thread 'tests::test_analyze_layout_empty' (2288528) panicked at libs/keyforge-physics/src/lib.rs:210:9:
assertion failed: result.is_err()

failures:
    tests::test_analyze_layout_comprehensive
    tests::test_analyze_layout_empty

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
