*** libs/keyforge-physics/src/lib.rs:56:9: replace ScoringEngine::suggest_improvements -> Vec<SwapSuggestion> with vec![]

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace ScoringEngine::suggest_improvements -> Vec<SwapSuggestion> with vec![]
@@ -48,17 +48,17 @@
     pub fn analyze(&self, layout: &Layout) -> AnalysisReport {
         let validated = ValidatedLayout::new(&layout.keys, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         analyze_layout(&self.ctx, &validated)
     }
 
     #[instrument(skip(self, layout))]
     pub fn suggest_improvements(&self, layout: &Layout) -> Vec<SwapSuggestion> {
-        suggest_swaps(&self.ctx, layout)
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn calculate_swap_delta(
         &self,
         layout: &[KeyCode],
         pos_map: &[u16],
         idx_a: usize,
         idx_b: usize,

---- test_heuristics_swap_suggestion_success stdout ----

thread 'test_heuristics_swap_suggestion_success' (2289379) panicked at libs/keyforge-physics/tests/coverage_tests.rs:212:5:
Should suggest a swap

failures:
    test_heuristics_swap_suggestion_success

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
