*** libs/keyforge-physics/src/lib.rs:66:9: replace ScoringEngine::calculate_swap_delta -> i64 with 0

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace ScoringEngine::calculate_swap_delta -> i64 with 0
@@ -58,19 +58,17 @@
 
     pub fn calculate_swap_delta(
         &self,
         layout: &[KeyCode],
         pos_map: &[u16],
         idx_a: usize,
         idx_b: usize,
     ) -> i64 {
-        let validated = ValidatedLayout::new(layout, self.ctx.key_count)
-            .expect("Physics Violation: Layout size mismatch");
-        kernel::compute::calculate_swap_delta(&self.ctx, &validated, pos_map, idx_a, idx_b)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn score_raw(&self, layout: &[KeyCode]) -> i64 {
         let validated = ValidatedLayout::new(layout, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         let mut pos_map = vec![65535u16; 65536];
         score_layout(&self.ctx, &validated, &mut pos_map)
     }

---- test_delta_parity_unique_keys stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'test_delta_parity_unique_keys' (2290241) panicked at libs/keyforge-physics/tests/delta_validity.rs:57:1:
Test failed: assertion failed: `(left == right)` 
  left: `-331500000`, 
 right: `0`: Delta mismatch! score_after(68500000) - score_before(400000000) = -331500000, but calculate_swap_delta returned 0 at libs/keyforge-physics/tests/delta_validity.rs:98.
minimal failing input: kb = Keyboard {
    keys: [
        KeyNode {
            index: 0,
            label: "k",
            x: 0.0,
            y: 0.0,

failures:
    test_delta_parity_unique_keys

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 53.36s

*** result: Failure(101)
