*** libs/keyforge-physics/src/lib.rs:66:9: replace ScoringEngine::calculate_swap_delta -> i64 with -1

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace ScoringEngine::calculate_swap_delta -> i64 with -1
@@ -58,19 +58,17 @@
 
     pub fn calculate_swap_delta(
         &self,
         layout: &[KeyCode],
         pos_map: &[u16],
         idx_a: usize,
         idx_b: usize,
     ) -> i64 {
-        let validated = ValidatedLayout::new(layout, self.ctx.key_count)
-            .expect("Physics Violation: Layout size mismatch");
-        kernel::compute::calculate_swap_delta(&self.ctx, &validated, pos_map, idx_a, idx_b)
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn score_raw(&self, layout: &[KeyCode]) -> i64 {
         let validated = ValidatedLayout::new(layout, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         let mut pos_map = vec![65535u16; 65536];
         score_layout(&self.ctx, &validated, &mut pos_map)
     }

---- tests::test_swap_delta_bounds_strict stdout ----

thread 'tests::test_swap_delta_bounds_strict' (2292326) panicked at libs/keyforge-physics/src/lib.rs:228:9:
assertion `left == right` failed
  left: -1
 right: 0

failures:
    tests::test_swap_delta_bounds_strict

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
