*** libs/keyforge-physics/src/lib.rs:72:9: replace ScoringEngine::score_raw -> i64 with 0

*** mutation diff:
--- libs/keyforge-physics/src/lib.rs
+++ replace ScoringEngine::score_raw -> i64 with 0
@@ -64,20 +64,17 @@
         idx_b: usize,
     ) -> i64 {
         let validated = ValidatedLayout::new(layout, self.ctx.key_count)
             .expect("Physics Violation: Layout size mismatch");
         kernel::compute::calculate_swap_delta(&self.ctx, &validated, pos_map, idx_a, idx_b)
     }
 
     pub fn score_raw(&self, layout: &[KeyCode]) -> i64 {
-        let validated = ValidatedLayout::new(layout, self.ctx.key_count)
-            .expect("Physics Violation: Layout size mismatch");
-        let mut pos_map = vec![65535u16; 65536];
-        score_layout(&self.ctx, &validated, &mut pos_map)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn key_count(&self) -> usize {
         self.ctx.key_count
     }
 
     pub fn context(&self) -> &EngineContext {
         &self.ctx

*** result: Success
